Simulation_code/saltConcentration/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1e-9;

vertices
(

   (0 0 -20) //0
   (1 0 -20) //1
   (1 1 -20) //2
   (0 1 -20) //3
   (0 0 20) //4
   (1 0 20) //5
   (1 1 20) //6
   (0 1 20) //7


);

blocks
(
    hex (0 1 2 3 4 5 6 7) B0 (80 80 1) simpleGrading (1 1 1) //0 
);

edges
(
);

boundary
(
    elecNorth
    {
      type patch;
      faces
      (
            (0 3 2 1)   
      );
    }
    elecSouth
    {
      type patch;
      faces
      (
            (4 5 6 7)   
        );
    }
    Sides
    {
        type empty;
        faces
        (
            (0 4 7 3)
            (3 7 6 2)
            (2 6 5 1)
            (1 5 4 0)             
        );
    }
);

mergePatchPairs
(
);
// ************************************************************************* //
