Simulation_code/saltConcentration/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    elecNorth
    {
        type            patch;
        nFaces          6400;
        startFace       12640;
    }
    elecSouth
    {
        type            patch;
        nFaces          6400;
        startFace       19040;
    }
    Sides
    {
        type            empty;
        nFaces          320;
        startFace       25440;
    }
)


// ************************************************************************* //
