Simulation_code/saltConcentration/0/psi
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      psi;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 2 -3 0 0 -1 0];

internalField   uniform 0;

boundaryField
{
    elecNorth
    {
	type            fixedValue;
	value           uniform 0.025;      
    }
   
    elecSouth
    {
	type            fixedValue;
	value           uniform 0;        
    }
    
    Sides
    {
	type            empty;     
    }    
}

// ************************************************************************* //
